set_device -family {SmartFusion2} -die {M2S060}
read_verilog -mode verilog_2k -lib COREAHBLITE_LIB {C:\Users\ciaran.lappin\Documents\Boards\SmartFusion2\SF2Plus_test\component\Actel\DirectCore\CoreAHBLite\5.2.100\rtl\vlog\core\coreahblite.v}
read_verilog -mode verilog_2k -lib COREAHBLITE_LIB {C:\Users\ciaran.lappin\Documents\Boards\SmartFusion2\SF2Plus_test\component\Actel\DirectCore\CoreAHBLite\5.2.100\rtl\vlog\core\coreahblite_addrdec.v}
read_verilog -mode verilog_2k -lib COREAHBLITE_LIB {C:\Users\ciaran.lappin\Documents\Boards\SmartFusion2\SF2Plus_test\component\Actel\DirectCore\CoreAHBLite\5.2.100\rtl\vlog\core\coreahblite_defaultslavesm.v}
read_verilog -mode verilog_2k -lib COREAHBLITE_LIB {C:\Users\ciaran.lappin\Documents\Boards\SmartFusion2\SF2Plus_test\component\Actel\DirectCore\CoreAHBLite\5.2.100\rtl\vlog\core\coreahblite_masterstage.v}
read_verilog -mode verilog_2k -lib COREAHBLITE_LIB {C:\Users\ciaran.lappin\Documents\Boards\SmartFusion2\SF2Plus_test\component\Actel\DirectCore\CoreAHBLite\5.2.100\rtl\vlog\core\coreahblite_matrix4x16.v}
read_verilog -mode verilog_2k -lib COREAHBLITE_LIB {C:\Users\ciaran.lappin\Documents\Boards\SmartFusion2\SF2Plus_test\component\Actel\DirectCore\CoreAHBLite\5.2.100\rtl\vlog\core\coreahblite_slavearbiter.v}
read_verilog -mode verilog_2k -lib COREAHBLITE_LIB {C:\Users\ciaran.lappin\Documents\Boards\SmartFusion2\SF2Plus_test\component\Actel\DirectCore\CoreAHBLite\5.2.100\rtl\vlog\core\coreahblite_slavestage.v}
read_verilog -mode verilog_2k -lib COREAHBTOAPB3_LIB {C:\Users\ciaran.lappin\Documents\Boards\SmartFusion2\SF2Plus_test\component\Actel\DirectCore\COREAHBTOAPB3\3.1.100\rtl\vlog\core\coreahbtoapb3.v}
read_verilog -mode verilog_2k -lib COREAHBTOAPB3_LIB {C:\Users\ciaran.lappin\Documents\Boards\SmartFusion2\SF2Plus_test\component\Actel\DirectCore\COREAHBTOAPB3\3.1.100\rtl\vlog\core\coreahbtoapb3_ahbtoapbsm.v}
read_verilog -mode verilog_2k -lib COREAHBTOAPB3_LIB {C:\Users\ciaran.lappin\Documents\Boards\SmartFusion2\SF2Plus_test\component\Actel\DirectCore\COREAHBTOAPB3\3.1.100\rtl\vlog\core\coreahbtoapb3_apbaddrdata.v}
read_verilog -mode verilog_2k -lib COREAHBTOAPB3_LIB {C:\Users\ciaran.lappin\Documents\Boards\SmartFusion2\SF2Plus_test\component\Actel\DirectCore\COREAHBTOAPB3\3.1.100\rtl\vlog\core\coreahbtoapb3_penablescheduler.v}
read_verilog -mode verilog_2k -lib COREAPB3_LIB {C:\Users\ciaran.lappin\Documents\Boards\SmartFusion2\SF2Plus_test\component\Actel\DirectCore\CoreAPB3\4.1.100\rtl\vlog\core\coreapb3.v}
read_verilog -mode verilog_2k -lib COREAPB3_LIB {C:\Users\ciaran.lappin\Documents\Boards\SmartFusion2\SF2Plus_test\component\Actel\DirectCore\CoreAPB3\4.1.100\rtl\vlog\core\coreapb3_iaddr_reg.v}
read_verilog -mode verilog_2k -lib COREAPB3_LIB {C:\Users\ciaran.lappin\Documents\Boards\SmartFusion2\SF2Plus_test\component\Actel\DirectCore\CoreAPB3\4.1.100\rtl\vlog\core\coreapb3_muxptob3.v}
read_verilog -mode verilog_2k -lib COREAXITOAHBL {C:\Users\ciaran.lappin\Documents\Boards\SmartFusion2\SF2Plus_test\component\Actel\DirectCore\COREAXITOAHBL\3.0.101\rtl\vlog\core\CoreAXItoAHBL.v}
read_verilog -mode verilog_2k -lib COREAXITOAHBL {C:\Users\ciaran.lappin\Documents\Boards\SmartFusion2\SF2Plus_test\component\Actel\DirectCore\COREAXITOAHBL\3.0.101\rtl\vlog\core\CoreAXItoAHBL_AHBMasterCtrl.v}
read_verilog -mode verilog_2k -lib COREAXITOAHBL {C:\Users\ciaran.lappin\Documents\Boards\SmartFusion2\SF2Plus_test\component\Actel\DirectCore\COREAXITOAHBL\3.0.101\rtl\vlog\core\CoreAXItoAHBL_AXIOutReg.v}
read_verilog -mode verilog_2k -lib COREAXITOAHBL {C:\Users\ciaran.lappin\Documents\Boards\SmartFusion2\SF2Plus_test\component\Actel\DirectCore\COREAXITOAHBL\3.0.101\rtl\vlog\core\CoreAXItoAHBL_AXISlaveCtrl.v}
read_verilog -mode verilog_2k -lib COREAXITOAHBL {C:\Users\ciaran.lappin\Documents\Boards\SmartFusion2\SF2Plus_test\component\Actel\DirectCore\COREAXITOAHBL\3.0.101\rtl\vlog\core\CoreAXItoAHBL_RAM_syncWrAsyncRd.v}
read_verilog -mode verilog_2k -lib COREAXITOAHBL {C:\Users\ciaran.lappin\Documents\Boards\SmartFusion2\SF2Plus_test\component\Actel\DirectCore\COREAXITOAHBL\3.0.101\rtl\vlog\core\CoreAXItoAHBL_readByteCnt.v}
read_verilog -mode verilog_2k -lib COREAXITOAHBL {C:\Users\ciaran.lappin\Documents\Boards\SmartFusion2\SF2Plus_test\component\Actel\DirectCore\COREAXITOAHBL\3.0.101\rtl\vlog\core\CoreAXItoAHBL_synchronizer.v}
read_verilog -mode verilog_2k -lib COREAXITOAHBL {C:\Users\ciaran.lappin\Documents\Boards\SmartFusion2\SF2Plus_test\component\Actel\DirectCore\COREAXITOAHBL\3.0.101\rtl\vlog\core\CoreAXItoAHBL_WSTRBAddrOffset.v}
read_verilog -mode verilog_2k -lib COREAXITOAHBL {C:\Users\ciaran.lappin\Documents\Boards\SmartFusion2\SF2Plus_test\component\Actel\DirectCore\COREAXITOAHBL\3.0.101\rtl\vlog\core\CoreAXItoAHBL_WSTRBPopCntr.v}
read_verilog -mode verilog_2k {C:\Users\ciaran.lappin\Documents\Boards\SmartFusion2\SF2Plus_test\component\Actel\DirectCore\CoreConfigP\7.1.100\rtl\vlog\core\coreconfigp.v}
read_verilog -mode verilog_2k {C:\Users\ciaran.lappin\Documents\Boards\SmartFusion2\SF2Plus_test\component\Actel\DirectCore\CoreGPIO\3.1.101\rtl\vlog\core\coregpio.v}
read_verilog -mode verilog_2k -lib COREJTAGDEBUG_LIB {C:\Users\ciaran.lappin\Documents\Boards\SmartFusion2\SF2Plus_test\component\Actel\DirectCore\COREJTAGDEBUG\2.0.2\rtl\vlog\core\corejtagdebug.v}
read_verilog -mode verilog_2k -lib COREJTAGDEBUG_LIB {C:\Users\ciaran.lappin\Documents\Boards\SmartFusion2\SF2Plus_test\component\Actel\DirectCore\COREJTAGDEBUG\2.0.2\rtl\vlog\core\corejtagdebug_uj_jtag.v}
read_verilog -mode verilog_2k {C:\Users\ciaran.lappin\Documents\Boards\SmartFusion2\SF2Plus_test\component\Actel\DirectCore\CoreResetP\7.1.100\rtl\vlog\core\coreresetp.v}
read_verilog -mode verilog_2k {C:\Users\ciaran.lappin\Documents\Boards\SmartFusion2\SF2Plus_test\component\Actel\DirectCore\CoreResetP\7.1.100\rtl\vlog\core\coreresetp_pcie_hotreset.v}
read_verilog -mode verilog_2k {C:\Users\ciaran.lappin\Documents\Boards\SmartFusion2\SF2Plus_test\component\Actel\DirectCore\CORERISCV_AXI4\1.0.101\rtl\verilog\ALU.v}
read_verilog -mode verilog_2k {C:\Users\ciaran.lappin\Documents\Boards\SmartFusion2\SF2Plus_test\component\Actel\DirectCore\CORERISCV_AXI4\1.0.101\rtl\verilog\Arbiter.v}
read_verilog -mode verilog_2k {C:\Users\ciaran.lappin\Documents\Boards\SmartFusion2\SF2Plus_test\component\Actel\DirectCore\CORERISCV_AXI4\1.0.101\rtl\verilog\Arbiter_1.v}
read_verilog -mode verilog_2k {C:\Users\ciaran.lappin\Documents\Boards\SmartFusion2\SF2Plus_test\component\Actel\DirectCore\CORERISCV_AXI4\1.0.101\rtl\verilog\Arbiter_2.v}
read_verilog -mode verilog_2k {C:\Users\ciaran.lappin\Documents\Boards\SmartFusion2\SF2Plus_test\component\Actel\DirectCore\CORERISCV_AXI4\1.0.101\rtl\verilog\AsyncFifo.v}
read_verilog -mode verilog_2k {C:\Users\ciaran.lappin\Documents\Boards\SmartFusion2\SF2Plus_test\component\Actel\DirectCore\CORERISCV_AXI4\1.0.101\rtl\verilog\BasicBus.v}
read_verilog -mode verilog_2k {C:\Users\ciaran.lappin\Documents\Boards\SmartFusion2\SF2Plus_test\component\Actel\DirectCore\CORERISCV_AXI4\1.0.101\rtl\verilog\BasicBus_1.v}
read_verilog -mode verilog_2k {C:\Users\ciaran.lappin\Documents\Boards\SmartFusion2\SF2Plus_test\component\Actel\DirectCore\CORERISCV_AXI4\1.0.101\rtl\verilog\BasicBus_2.v}
read_verilog -mode verilog_2k {C:\Users\ciaran.lappin\Documents\Boards\SmartFusion2\SF2Plus_test\component\Actel\DirectCore\CORERISCV_AXI4\1.0.101\rtl\verilog\BasicBus_3.v}
read_verilog -mode verilog_2k {C:\Users\ciaran.lappin\Documents\Boards\SmartFusion2\SF2Plus_test\component\Actel\DirectCore\CORERISCV_AXI4\1.0.101\rtl\verilog\BasicBus_4.v}
read_verilog -mode verilog_2k {C:\Users\ciaran.lappin\Documents\Boards\SmartFusion2\SF2Plus_test\component\Actel\DirectCore\CORERISCV_AXI4\1.0.101\rtl\verilog\BreakpointUnit.v}
read_verilog -mode verilog_2k {C:\Users\ciaran.lappin\Documents\Boards\SmartFusion2\SF2Plus_test\component\Actel\DirectCore\CORERISCV_AXI4\1.0.101\rtl\verilog\ClientTileLinkEnqueuer.v}
read_verilog -mode verilog_2k {C:\Users\ciaran.lappin\Documents\Boards\SmartFusion2\SF2Plus_test\component\Actel\DirectCore\CORERISCV_AXI4\1.0.101\rtl\verilog\ClientTileLinkIOUnwrapper.v}
read_verilog -mode verilog_2k {C:\Users\ciaran.lappin\Documents\Boards\SmartFusion2\SF2Plus_test\component\Actel\DirectCore\CORERISCV_AXI4\1.0.101\rtl\verilog\ClientTileLinkNetworkPort.v}
read_verilog -mode verilog_2k {C:\Users\ciaran.lappin\Documents\Boards\SmartFusion2\SF2Plus_test\component\Actel\DirectCore\CORERISCV_AXI4\1.0.101\rtl\verilog\ClientUncachedTileLinkIOArbiter.v}
read_verilog -mode verilog_2k {C:\Users\ciaran.lappin\Documents\Boards\SmartFusion2\SF2Plus_test\component\Actel\DirectCore\CORERISCV_AXI4\1.0.101\rtl\verilog\ClientUncachedTileLinkIOArbiter_1.v}
read_verilog -mode verilog_2k {C:\Users\ciaran.lappin\Documents\Boards\SmartFusion2\SF2Plus_test\component\Actel\DirectCore\CORERISCV_AXI4\1.0.101\rtl\verilog\ClientUncachedTileLinkIOCrossbar.v}
read_verilog -mode verilog_2k {C:\Users\ciaran.lappin\Documents\Boards\SmartFusion2\SF2Plus_test\component\Actel\DirectCore\CORERISCV_AXI4\1.0.101\rtl\verilog\ClientUncachedTileLinkIOCrossbar_1.v}
read_verilog -mode verilog_2k {C:\Users\ciaran.lappin\Documents\Boards\SmartFusion2\SF2Plus_test\component\Actel\DirectCore\CORERISCV_AXI4\1.0.101\rtl\verilog\ClientUncachedTileLinkIORouter.v}
read_verilog -mode verilog_2k {C:\Users\ciaran.lappin\Documents\Boards\SmartFusion2\SF2Plus_test\component\Actel\DirectCore\CORERISCV_AXI4\1.0.101\rtl\verilog\ClientUncachedTileLinkIORouter_1.v}
read_verilog -mode verilog_2k {C:\Users\ciaran.lappin\Documents\Boards\SmartFusion2\SF2Plus_test\component\Actel\DirectCore\CORERISCV_AXI4\1.0.101\rtl\verilog\ClientUncachedTileLinkNetworkPort.v}
read_verilog -mode verilog_2k {C:\Users\ciaran.lappin\Documents\Boards\SmartFusion2\SF2Plus_test\component\Actel\DirectCore\CORERISCV_AXI4\1.0.101\rtl\verilog\CoreRISCV_AXI4.v}
read_verilog -mode verilog_2k {C:\Users\ciaran.lappin\Documents\Boards\SmartFusion2\SF2Plus_test\component\Actel\DirectCore\CORERISCV_AXI4\1.0.101\rtl\verilog\CSRFile.v}
read_verilog -mode verilog_2k {C:\Users\ciaran.lappin\Documents\Boards\SmartFusion2\SF2Plus_test\component\Actel\DirectCore\CORERISCV_AXI4\1.0.101\rtl\verilog\DCache.v}
read_verilog -mode verilog_2k {C:\Users\ciaran.lappin\Documents\Boards\SmartFusion2\SF2Plus_test\component\Actel\DirectCore\CORERISCV_AXI4\1.0.101\rtl\verilog\DCacheDataArray_G4.v}
read_verilog -mode verilog_2k {C:\Users\ciaran.lappin\Documents\Boards\SmartFusion2\SF2Plus_test\component\Actel\DirectCore\CORERISCV_AXI4\1.0.101\rtl\verilog\DebugModule.v}
read_verilog -mode verilog_2k {C:\Users\ciaran.lappin\Documents\Boards\SmartFusion2\SF2Plus_test\component\Actel\DirectCore\CORERISCV_AXI4\1.0.101\rtl\verilog\DebugTransportModuleJtag.v}
read_verilog -mode verilog_2k {C:\Users\ciaran.lappin\Documents\Boards\SmartFusion2\SF2Plus_test\component\Actel\DirectCore\CORERISCV_AXI4\1.0.101\rtl\verilog\FinishQueue.v}
read_verilog -mode verilog_2k {C:\Users\ciaran.lappin\Documents\Boards\SmartFusion2\SF2Plus_test\component\Actel\DirectCore\CORERISCV_AXI4\1.0.101\rtl\verilog\FinishQueue_1.v}
read_verilog -mode verilog_2k {C:\Users\ciaran.lappin\Documents\Boards\SmartFusion2\SF2Plus_test\component\Actel\DirectCore\CORERISCV_AXI4\1.0.101\rtl\verilog\FinishUnit.v}
read_verilog -mode verilog_2k {C:\Users\ciaran.lappin\Documents\Boards\SmartFusion2\SF2Plus_test\component\Actel\DirectCore\CORERISCV_AXI4\1.0.101\rtl\verilog\FlowThroughSerializer.v}
read_verilog -mode verilog_2k {C:\Users\ciaran.lappin\Documents\Boards\SmartFusion2\SF2Plus_test\component\Actel\DirectCore\CORERISCV_AXI4\1.0.101\rtl\verilog\Frontend.v}
read_verilog -mode verilog_2k {C:\Users\ciaran.lappin\Documents\Boards\SmartFusion2\SF2Plus_test\component\Actel\DirectCore\CORERISCV_AXI4\1.0.101\rtl\verilog\HellaCacheArbiter.v}
read_verilog -mode verilog_2k {C:\Users\ciaran.lappin\Documents\Boards\SmartFusion2\SF2Plus_test\component\Actel\DirectCore\CORERISCV_AXI4\1.0.101\rtl\verilog\ICache.v}
read_verilog -mode verilog_2k {C:\Users\ciaran.lappin\Documents\Boards\SmartFusion2\SF2Plus_test\component\Actel\DirectCore\CORERISCV_AXI4\1.0.101\rtl\verilog\IdMapper.v}
read_verilog -mode verilog_2k {C:\Users\ciaran.lappin\Documents\Boards\SmartFusion2\SF2Plus_test\component\Actel\DirectCore\CORERISCV_AXI4\1.0.101\rtl\verilog\LevelGateway.v}
read_verilog -mode verilog_2k {C:\Users\ciaran.lappin\Documents\Boards\SmartFusion2\SF2Plus_test\component\Actel\DirectCore\CORERISCV_AXI4\1.0.101\rtl\verilog\LockingArbiter.v}
read_verilog -mode verilog_2k {C:\Users\ciaran.lappin\Documents\Boards\SmartFusion2\SF2Plus_test\component\Actel\DirectCore\CORERISCV_AXI4\1.0.101\rtl\verilog\LockingArbiter_1.v}
read_verilog -mode verilog_2k {C:\Users\ciaran.lappin\Documents\Boards\SmartFusion2\SF2Plus_test\component\Actel\DirectCore\CORERISCV_AXI4\1.0.101\rtl\verilog\LockingRRArbiter.v}
read_verilog -mode verilog_2k {C:\Users\ciaran.lappin\Documents\Boards\SmartFusion2\SF2Plus_test\component\Actel\DirectCore\CORERISCV_AXI4\1.0.101\rtl\verilog\LockingRRArbiter_1.v}
read_verilog -mode verilog_2k {C:\Users\ciaran.lappin\Documents\Boards\SmartFusion2\SF2Plus_test\component\Actel\DirectCore\CORERISCV_AXI4\1.0.101\rtl\verilog\LockingRRArbiter_2.v}
read_verilog -mode verilog_2k {C:\Users\ciaran.lappin\Documents\Boards\SmartFusion2\SF2Plus_test\component\Actel\DirectCore\CORERISCV_AXI4\1.0.101\rtl\verilog\LockingRRArbiter_3.v}
read_verilog -mode verilog_2k {C:\Users\ciaran.lappin\Documents\Boards\SmartFusion2\SF2Plus_test\component\Actel\DirectCore\CORERISCV_AXI4\1.0.101\rtl\verilog\LockingRRArbiter_4.v}
read_verilog -mode verilog_2k {C:\Users\ciaran.lappin\Documents\Boards\SmartFusion2\SF2Plus_test\component\Actel\DirectCore\CORERISCV_AXI4\1.0.101\rtl\verilog\LockingRRArbiter_5.v}
read_verilog -mode verilog_2k {C:\Users\ciaran.lappin\Documents\Boards\SmartFusion2\SF2Plus_test\component\Actel\DirectCore\CORERISCV_AXI4\1.0.101\rtl\verilog\LockingRRArbiter_6.v}
read_verilog -mode verilog_2k {C:\Users\ciaran.lappin\Documents\Boards\SmartFusion2\SF2Plus_test\component\Actel\DirectCore\CORERISCV_AXI4\1.0.101\rtl\verilog\LockingRRArbiter_7.v}
read_verilog -mode verilog_2k {C:\Users\ciaran.lappin\Documents\Boards\SmartFusion2\SF2Plus_test\component\Actel\DirectCore\CORERISCV_AXI4\1.0.101\rtl\verilog\ManagerTileLinkNetworkPort.v}
read_verilog -mode verilog_2k {C:\Users\ciaran.lappin\Documents\Boards\SmartFusion2\SF2Plus_test\component\Actel\DirectCore\CORERISCV_AXI4\1.0.101\rtl\verilog\ManagerTileLinkNetworkPort_1.v}
read_verilog -mode verilog_2k {C:\Users\ciaran.lappin\Documents\Boards\SmartFusion2\SF2Plus_test\component\Actel\DirectCore\CORERISCV_AXI4\1.0.101\rtl\verilog\ManagerToClientStatelessBridge.v}
read_verilog -mode verilog_2k {C:\Users\ciaran.lappin\Documents\Boards\SmartFusion2\SF2Plus_test\component\Actel\DirectCore\CORERISCV_AXI4\1.0.101\rtl\verilog\MetadataArray.v}
read_verilog -mode verilog_2k {C:\Users\ciaran.lappin\Documents\Boards\SmartFusion2\SF2Plus_test\component\Actel\DirectCore\CORERISCV_AXI4\1.0.101\rtl\verilog\MMIOTileLinkManager.v}
read_verilog -mode verilog_2k {C:\Users\ciaran.lappin\Documents\Boards\SmartFusion2\SF2Plus_test\component\Actel\DirectCore\CORERISCV_AXI4\1.0.101\rtl\verilog\MulDiv.v}
read_verilog -mode verilog_2k {C:\Users\ciaran.lappin\Documents\Boards\SmartFusion2\SF2Plus_test\component\Actel\DirectCore\CORERISCV_AXI4\1.0.101\rtl\verilog\NastiIOTileLinkIOConverter.v}
read_verilog -mode verilog_2k {C:\Users\ciaran.lappin\Documents\Boards\SmartFusion2\SF2Plus_test\component\Actel\DirectCore\CORERISCV_AXI4\1.0.101\rtl\verilog\NastiIOTileLinkIOConverter_1.v}
read_verilog -mode verilog_2k {C:\Users\ciaran.lappin\Documents\Boards\SmartFusion2\SF2Plus_test\component\Actel\DirectCore\CORERISCV_AXI4\1.0.101\rtl\verilog\OuterMemorySystem.v}
read_verilog -mode verilog_2k {C:\Users\ciaran.lappin\Documents\Boards\SmartFusion2\SF2Plus_test\component\Actel\DirectCore\CORERISCV_AXI4\1.0.101\rtl\verilog\PLIC.v}
read_verilog -mode verilog_2k {C:\Users\ciaran.lappin\Documents\Boards\SmartFusion2\SF2Plus_test\component\Actel\DirectCore\CORERISCV_AXI4\1.0.101\rtl\verilog\PortedTileLinkCrossbar.v}
read_verilog -mode verilog_2k {C:\Users\ciaran.lappin\Documents\Boards\SmartFusion2\SF2Plus_test\component\Actel\DirectCore\CORERISCV_AXI4\1.0.101\rtl\verilog\PRCI.v}
read_verilog -mode verilog_2k {C:\Users\ciaran.lappin\Documents\Boards\SmartFusion2\SF2Plus_test\component\Actel\DirectCore\CORERISCV_AXI4\1.0.101\rtl\verilog\Queue.v}
read_verilog -mode verilog_2k {C:\Users\ciaran.lappin\Documents\Boards\SmartFusion2\SF2Plus_test\component\Actel\DirectCore\CORERISCV_AXI4\1.0.101\rtl\verilog\Queue_1.v}
read_verilog -mode verilog_2k {C:\Users\ciaran.lappin\Documents\Boards\SmartFusion2\SF2Plus_test\component\Actel\DirectCore\CORERISCV_AXI4\1.0.101\rtl\verilog\Queue_10.v}
read_verilog -mode verilog_2k {C:\Users\ciaran.lappin\Documents\Boards\SmartFusion2\SF2Plus_test\component\Actel\DirectCore\CORERISCV_AXI4\1.0.101\rtl\verilog\Queue_12.v}
read_verilog -mode verilog_2k {C:\Users\ciaran.lappin\Documents\Boards\SmartFusion2\SF2Plus_test\component\Actel\DirectCore\CORERISCV_AXI4\1.0.101\rtl\verilog\Queue_13.v}
read_verilog -mode verilog_2k {C:\Users\ciaran.lappin\Documents\Boards\SmartFusion2\SF2Plus_test\component\Actel\DirectCore\CORERISCV_AXI4\1.0.101\rtl\verilog\Queue_14.v}
read_verilog -mode verilog_2k {C:\Users\ciaran.lappin\Documents\Boards\SmartFusion2\SF2Plus_test\component\Actel\DirectCore\CORERISCV_AXI4\1.0.101\rtl\verilog\Queue_2.v}
read_verilog -mode verilog_2k {C:\Users\ciaran.lappin\Documents\Boards\SmartFusion2\SF2Plus_test\component\Actel\DirectCore\CORERISCV_AXI4\1.0.101\rtl\verilog\Queue_3.v}
read_verilog -mode verilog_2k {C:\Users\ciaran.lappin\Documents\Boards\SmartFusion2\SF2Plus_test\component\Actel\DirectCore\CORERISCV_AXI4\1.0.101\rtl\verilog\Queue_8.v}
read_verilog -mode verilog_2k {C:\Users\ciaran.lappin\Documents\Boards\SmartFusion2\SF2Plus_test\component\Actel\DirectCore\CORERISCV_AXI4\1.0.101\rtl\verilog\Queue_9.v}
read_verilog -mode verilog_2k {C:\Users\ciaran.lappin\Documents\Boards\SmartFusion2\SF2Plus_test\component\Actel\DirectCore\CORERISCV_AXI4\1.0.101\rtl\verilog\ReorderQueue.v}
read_verilog -mode verilog_2k {C:\Users\ciaran.lappin\Documents\Boards\SmartFusion2\SF2Plus_test\component\Actel\DirectCore\CORERISCV_AXI4\1.0.101\rtl\verilog\ReorderQueue_2.v}
read_verilog -mode verilog_2k {C:\Users\ciaran.lappin\Documents\Boards\SmartFusion2\SF2Plus_test\component\Actel\DirectCore\CORERISCV_AXI4\1.0.101\rtl\verilog\ReorderQueue_3.v}
read_verilog -mode verilog_2k {C:\Users\ciaran.lappin\Documents\Boards\SmartFusion2\SF2Plus_test\component\Actel\DirectCore\CORERISCV_AXI4\1.0.101\rtl\verilog\Rocket.v}
read_verilog -mode verilog_2k {C:\Users\ciaran.lappin\Documents\Boards\SmartFusion2\SF2Plus_test\component\Actel\DirectCore\CORERISCV_AXI4\1.0.101\rtl\verilog\RocketTile.v}
read_verilog -mode verilog_2k {C:\Users\ciaran.lappin\Documents\Boards\SmartFusion2\SF2Plus_test\component\Actel\DirectCore\CORERISCV_AXI4\1.0.101\rtl\verilog\ROMSlave.v}
read_verilog -mode verilog_2k {C:\Users\ciaran.lappin\Documents\Boards\SmartFusion2\SF2Plus_test\component\Actel\DirectCore\CORERISCV_AXI4\1.0.101\rtl\verilog\TileLinkEnqueuer.v}
read_verilog -mode verilog_2k {C:\Users\ciaran.lappin\Documents\Boards\SmartFusion2\SF2Plus_test\component\Actel\DirectCore\CORERISCV_AXI4\1.0.101\rtl\verilog\TileLinkEnqueuer_1.v}
read_verilog -mode verilog_2k {C:\Users\ciaran.lappin\Documents\Boards\SmartFusion2\SF2Plus_test\component\Actel\DirectCore\CORERISCV_AXI4\1.0.101\rtl\verilog\TileLinkEnqueuer_2.v}
read_verilog -mode verilog_2k {C:\Users\ciaran.lappin\Documents\Boards\SmartFusion2\SF2Plus_test\component\Actel\DirectCore\CORERISCV_AXI4\1.0.101\rtl\verilog\TileLinkMemoryInterconnect.v}
read_verilog -mode verilog_2k {C:\Users\ciaran.lappin\Documents\Boards\SmartFusion2\SF2Plus_test\component\Actel\DirectCore\CORERISCV_AXI4\1.0.101\rtl\verilog\TileLinkRecursiveInterconnect.v}
read_verilog -mode verilog_2k {C:\Users\ciaran.lappin\Documents\Boards\SmartFusion2\SF2Plus_test\component\Actel\DirectCore\CORERISCV_AXI4\1.0.101\rtl\verilog\TileLinkRecursiveInterconnect_1.v}
read_verilog -mode verilog_2k {C:\Users\ciaran.lappin\Documents\Boards\SmartFusion2\SF2Plus_test\component\Actel\DirectCore\CORERISCV_AXI4\1.0.101\rtl\verilog\TLB.v}
read_verilog -mode verilog_2k {C:\Users\ciaran.lappin\Documents\Boards\SmartFusion2\SF2Plus_test\component\Actel\DirectCore\CORERISCV_AXI4\1.0.101\rtl\verilog\Top.v}
read_verilog -mode verilog_2k {C:\Users\ciaran.lappin\Documents\Boards\SmartFusion2\SF2Plus_test\component\Actel\DirectCore\CORERISCV_AXI4\1.0.101\rtl\verilog\Uncore.v}
read_verilog -mode verilog_2k -lib CORETIMER_LIB {C:\Users\ciaran.lappin\Documents\Boards\SmartFusion2\SF2Plus_test\component\Actel\DirectCore\CoreTimer\2.0.103\rtl\vlog\core\coretimer.v}
read_verilog -mode verilog_2k {C:\Users\ciaran.lappin\Documents\Boards\SmartFusion2\SF2Plus_test\component\User\GlueLogic\AXI_GLUE_LOGIC\1.0.7\vlog\AXI_glue_logic.v}
read_verilog -mode verilog_2k {C:\Users\ciaran.lappin\Documents\Boards\SmartFusion2\SF2Plus_test\component\work\MSS_SUBSYSTEM_sb\CCC_0\MSS_SUBSYSTEM_sb_CCC_0_FCCC.v}
read_verilog -mode verilog_2k {C:\Users\ciaran.lappin\Documents\Boards\SmartFusion2\SF2Plus_test\component\work\MSS_SUBSYSTEM_sb\FABOSC_0\MSS_SUBSYSTEM_sb_FABOSC_0_OSC.v}
read_verilog -mode verilog_2k {C:\Users\ciaran.lappin\Documents\Boards\SmartFusion2\SF2Plus_test\component\work\MSS_SUBSYSTEM_sb\MSS_SUBSYSTEM_sb.v}
read_verilog -mode verilog_2k {C:\Users\ciaran.lappin\Documents\Boards\SmartFusion2\SF2Plus_test\component\work\MSS_SUBSYSTEM_sb_MSS\MSS_SUBSYSTEM_sb_MSS.v}
read_verilog -mode verilog_2k {C:\Users\ciaran.lappin\Documents\Boards\SmartFusion2\SF2Plus_test\component\work\PROC_SUBSYSTEM\CoreUARTapb_0\rtl\vlog\core\Clock_gen.v}
read_verilog -mode verilog_2k {C:\Users\ciaran.lappin\Documents\Boards\SmartFusion2\SF2Plus_test\component\work\PROC_SUBSYSTEM\CoreUARTapb_0\rtl\vlog\core\CoreUART.v}
read_verilog -mode verilog_2k {C:\Users\ciaran.lappin\Documents\Boards\SmartFusion2\SF2Plus_test\component\work\PROC_SUBSYSTEM\CoreUARTapb_0\rtl\vlog\core\CoreUARTapb.v}
read_verilog -mode verilog_2k {C:\Users\ciaran.lappin\Documents\Boards\SmartFusion2\SF2Plus_test\component\work\PROC_SUBSYSTEM\CoreUARTapb_0\rtl\vlog\core\fifo_256x8_g4.v}
read_verilog -mode verilog_2k {C:\Users\ciaran.lappin\Documents\Boards\SmartFusion2\SF2Plus_test\component\work\PROC_SUBSYSTEM\CoreUARTapb_0\rtl\vlog\core\Rx_async.v}
read_verilog -mode verilog_2k {C:\Users\ciaran.lappin\Documents\Boards\SmartFusion2\SF2Plus_test\component\work\PROC_SUBSYSTEM\CoreUARTapb_0\rtl\vlog\core\Tx_async.v}
read_verilog -mode verilog_2k {C:\Users\ciaran.lappin\Documents\Boards\SmartFusion2\SF2Plus_test\component\work\PROC_SUBSYSTEM\PROC_SUBSYSTEM.v}
set_top_level {PROC_SUBSYSTEM}
read_sdc -component {C:\Users\ciaran.lappin\Documents\Boards\SmartFusion2\SF2Plus_test\component\work\MSS_SUBSYSTEM_sb\CCC_0\MSS_SUBSYSTEM_sb_CCC_0_FCCC.sdc}
read_sdc -component {C:\Users\ciaran.lappin\Documents\Boards\SmartFusion2\SF2Plus_test\component\work\MSS_SUBSYSTEM_sb\FABOSC_0\MSS_SUBSYSTEM_sb_FABOSC_0_OSC.sdc}
read_sdc -component {C:\Users\ciaran.lappin\Documents\Boards\SmartFusion2\SF2Plus_test\component\work\MSS_SUBSYSTEM_sb_MSS\MSS_SUBSYSTEM_sb_MSS.sdc}
derive_constraints
write_sdc {C:\Users\ciaran.lappin\Documents\Boards\SmartFusion2\SF2Plus_test\constraint\PROC_SUBSYSTEM_derived_constraints.sdc}
write_pdc {C:\Users\ciaran.lappin\Documents\Boards\SmartFusion2\SF2Plus_test\constraint\fp\PROC_SUBSYSTEM_derived_constraints.pdc}
